require "rspec"
require_relative "../lib/board"

describe Board do
  subject(:board) { described_class.new() }

  it "should exist" do
    expect(board).not_to be_nil
  end

  describe "#initialize" do
    it "should initialize a board full of ⚫️" do
      expect(board.board_array).to eql([
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️"
      ]) 
    end
  end

  describe "#get_move_index" do
    it "should return 5*7 + 0 = 35" do
      board.board_array = [
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️"
      ]

      expect(board.get_move_index(0)).to eql(35)
    end

    it "should return 4*7 + 0 = 28" do
      board.board_array = [
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "🔴",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️"
      ]

      expect(board.get_move_index(0)).to eql(28)
    end

    it "should return 2*7 + 1 = 15" do
      board.board_array = [
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "🔵",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "🔵",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "🔴",  "🔵",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️"
      ]

      expect(board.get_move_index(1)).to eql(15)
    end

    it "should return -1*7 + 1 = -6" do
      board.board_array = [
        "⚫️",  "🔵",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "🔵",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "🔵",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "🔵",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "⚫️",  "🔵",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️",
        "🔴",  "🔵",  "⚫️",  "⚫️",  "⚫️",  "⚫️",  "⚫️"
      ]

      expect(board.get_move_index(1)).to eql(-6)
    end
  end
end